1113:选票统计
难度： 秩序白银    时间限制： 1000MS   空间限制： 16MB   提交数： 14   通过数： 12 题目来源: nuistoj
题目内容
题目描述:
一年一度的南京信息工程大学“十佳大学生”选举开始了，根据海选结果，候选人达到了1000人，每个同学和老师都可以参加投票选举，并且每个人可以选若干人。学生和老师只需将自己要选举的候选人编号一次写在选票上即可。选举结束后，选委会进行选票统计。由于选票众多，且每张选票上被选举的人数不等，编写一个程序完成选票统计：将所有选票上的编号依次输入计算机，以-1表示统计结束，这时计算机要给所有的选票编号 及统计其得票数。

输入描述：
一行,一组以空格隔开的编号，以-1为结束。

输出描述：
按编号序号分若干行输出编号和得票数（不输出票数为0的候选人情况）

样例输入:
3 1 2 3 2 1 2 3 1 2 2 1 3 3 1 2 3 3 -1

样例输出:
1 5

2 6

3 7 
#include <iostream>
#include <algorithm>
using namespace std;
int main() {
	int n, a[100000] = {0}, maxn = 0;
	while(cin >> n) {
		if(n == -1) break;
		a[n]++;
		maxn = max(maxn,n);
	}
	for(int i = 0; i <= maxn; i++) 
		if(a[i]) cout << i << ' ' << a[i] << endl;
	return 0;
}
