1270:观看山巅
难度： 秩序白银    时间限制： 1000MS   空间限制： 64MB   提交数： 13   通过数： 6
题目内容
题目描述:
众所周知，太行山是一片山（而不是一座山）。假设这些山排成了一排。每座山有各自的高度。现在游客们从最左边看山，有些山因为高度没有它左边的某座山高，就会被遮住，游客们就无法看到。现在想请你告诉游客，他能看到几座山。（看到山顶即可被认为是看到了，如果恰好山顶被遮住了，这座山不算被看到）

输入描述：
第一行是一个整数N（1<=N<=100000）,表示有N座山。第二行，N个用空格隔开的正整数，依次表示从左到右每座山的高度。山的高度在长整型数范围内。

输出描述：
输出一个正整数，并占一行，表示从左端看，能看到多少座山。

样例输入:
5

3 7 7 2 8

样例输出:
3

#include <iostream>
#include <algorithm>
#include <string>
using namespace std;
int main() {
	int n;
	int a[100005];
	while(cin >> n) {	
		a[0] = 0; 
		int res = 0;
		int max = 0;
		for(int i = 1; i <= n; i++) {//dp思想 
			cin >> a[i];
			if(a[i] > max) {//次山峰若可以被看见res++，并更新最大值， 
				res++;
				max = a[i];
			}
		}
		cout << res << endl;
	} 
	return 0;
}


