1370:奇数校验码
难度： 倔强青铜    时间限制： 1000MS   空间限制： 2MB   提交数： 72   通过数： 20
题目内容
题目描述
奇偶校验法是一种检验信号传输正确与否的方法，其广泛用于生产生活的各个领域。一般地，奇偶校验法是根据被传输的一段二进制串中 0 或 1 的个数来进行校验的。

奇偶校验有多种不同的实现版本。在这里给出一个简化后的实现方案：若待检验的一段二进制串中 0 和 1 的个数均为奇数，则校验码为 1，否则为 0。若 0 (或者 1) 未出现，则视为其出现了偶数次。

程序使用的变量不要多于两个 char 类型

输入描述
有多组测试数据，每组测试数据占一行。

每行输入一段二进制串，代表待计算校验码的二进制串。

每个二进制串的长度 不少于 80,000,000。

不少于。。。

少于。。。

于。。。

至于多长我也不知道 ~ ~ ~

而且用的变量还不能多于两个 char ~ ~ ~

滑稽

输出描述
对于每组测试数据，输出一行结果。

输入样例
000111

10011

00000

10101100000001110000000011110000000000000000101111111111111111101010

输出样例
1

0

0

1



#include <iostream>
#include <algorithm>
#include <string>
using namespace std;
int main() {
//	freopen("test.txt","r",stdin);
	int is0 = 1, is1 = 1;
	char c;
	while(scanf("%c",&c) != EOF){
		if(c == '\n') {
			if(is0 == -1 && is1 == -1) 
				cout << 1 << endl;
			else
				cout << 0 << endl;
			is0 = is1 = 1;
			continue;
		}

			if(c == '0')
				is0 *= -1;
			else
				is1 *= -1;
	
		
	}	
	return 0;
}


